Revit 2027 API
BuiltInFailures.EditingFailures.CannotPickHereInCurrentView Property
 Can't pick here at this view angle. Set another Work Plane or adjust the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPickHereInCurrentView { get; }
Public Shared ReadOnly Property CannotPickHereInCurrentView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPickHereInCurrentView {
	FailureDefinitionId^ get ();
}
static member CannotPickHereInCurrentView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace